#+author: José Miguel Martínez Carrasco
#+email: jm@0pt1mates.com

* Introduction

Build 0pt1mates web site with a static web generator.

Finally I decided to go for [[http://orgmode.org/worg/org-tutorials/org-jekyll.html][jekyll and org-mode]].

* Org-mode and jekyll

 Proyecto.el content should be added to your *.emacs*, *.emacs.d/init.el* or *.emacs.d/personal/custom.el* if you are using [[https://github.com/bbatsov/prelude][Emacs Prelude]].

 #+INCLUDE: "./proyecto.el" src emacs-lisp

Create a jekyll project:

#+BEGIN_SRC bash
$ jekyll new jekyll
#+END_SRC

Until I find a better solution, wherever I am using RVM to manage ruby versions, when jekyll complains run:

#+BEGIN_SRC bash
$ rvm use 1.9.3-p194
#+END_SRC

* Workflow

Org-mode is exported as html to jekyll directory, and then we let jekyll to do the rest:

#+BEGIN_SRC bash
$ jekyll build
$ jekyll serve
#+END_SRC

* License

Copyright (c) 2014 0PT1MATES LTD.

See the LICENSE.txt file for license rights and limitations (Apache Version 2.0).

* Time report

 #+BEGIN: clocktable :maxlevel 2 :scope subtree
 #+CAPTION: Clock summary at [2014-07-27 Sun 23:35]
 | Headline                            | Time   |      |
 |-------------------------------------+--------+------|
 | *Total time*                        | *7:31* |      |
 |-------------------------------------+--------+------|
 | Time report                         | 7:31   |      |
 | \__ DONE available tools research   |        | 0:14 |
 | \__ DONE write content              |        | 1:45 |
 | \__ DONE revealjs slide             |        | 0:18 |
 | \__ DONE org-mode publishing        |        | 3:13 |
 | \__ DONE orgmode jekyll integration |        | 1:45 |
 | \__ DONE css tunning                |        | 0:16 |
 #+END:

** DONE available tools research
   CLOCK: [2014-04-30 Wed 18:09]--[2014-04-30 Wed 18:23] =>  0:14
** DONE write content
   CLOCK: [2014-05-16 Fri 13:47]--[2014-05-16 Fri 15:00] =>  1:13
   CLOCK: [2014-05-01 Thu 18:26]--[2014-05-01 Thu 18:58] =>  0:32
** DONE revealjs slide
   CLOCK: [2014-05-01 Thu 19:37]--[2014-05-01 Thu 19:55] =>  0:18
   CLOCK: [2014-05-01 Thu 19:20]--[2014-05-01 Thu 19:20] =>  0:00
** DONE org-mode publishing
   CLOCK: [2014-07-27 Sun 23:23]--[2014-07-27 Sun 23:35] =>  0:12
   CLOCK: [2014-05-15 Thu 21:37]--[2014-05-15 Thu 22:01] =>  0:24
   CLOCK: [2014-05-15 Thu 21:37]--[2014-05-15 Thu 21:37] =>  0:00
   CLOCK: [2014-05-15 Thu 16:40]--[2014-05-15 Thu 18:29] =>  1:49
   CLOCK: [2014-05-15 Thu 16:33]--[2014-05-15 Thu 16:38] =>  0:05
   CLOCK: [2014-05-15 Thu 14:42]--[2014-05-15 Thu 15:05] =>  0:23
   CLOCK: [2014-05-15 Thu 14:21]--[2014-05-15 Thu 14:41] =>  0:20
** DONE orgmode jekyll integration
   CLOCK: [2014-05-15 Thu 22:39]--[2014-05-16 Fri 00:24] =>  1:45
** DONE css tunning
   CLOCK: [2014-05-16 Fri 15:07]--[2014-05-16 Fri 15:23] =>  0:16
>>>>>>> Updating readme.
